**Problem Statement 1:**<br>
Is gender independent of education level? A random sample of 395 people were<br>
surveyed and each person was asked to report the highest education level they<br>
obtained. The data that resulted from the survey is summarized in the following table:<br>

  HighSchool Bachelors Masters Ph.d. Total<br>

Female  60     54        46      41    201<br>
Male    40     44        53      57    194<br>
Total   100    98        99      98    395<br>

Question: Are gender and education level dependent at 5% level of significance? In<br>
other words, given the data collected above, is there a relationship between the<br>
gender of an individual and the level of education that they have obtained?<br>

In [60]:
import scipy.stats as stats
from scipy.stats import norm
import math
import numpy as np
import pandas as pd


female = [60,54,46,41]
male =  [40,44,53,57]
highS = [60,40]
Bach = [54,44]
Master = [46,53]
phd = [41,57]
marks = male + female
sex = ['M','M','M','M','F','F','F','F']
ed = ['High School', 'Bachelors', 'Masters', 'Ph.d', 'High School', 'Bachelors', 'Masters', 'Ph.d']
df = pd.DataFrame({"Education":ed, "Marks":marks,"Sex":sex})
df

     Education  Marks Sex
0  High School     40   M
1    Bachelors     44   M
2      Masters     53   M
3         Ph.d     57   M
4  High School     60   F
5    Bachelors     54   F
6      Masters     46   F
7         Ph.d     41   F

In [61]:
ctb = pd.crosstab([df.Sex,df.Marks],df.Education)

In [62]:
ctb

Education  Bachelors  High School  Masters  Ph.d
Sex Marks
F   41             0            0        0     1
    46             0            0        1     0
    54             1            0        0     0
    60             0            1        0     0
M   40             0            1        0     0
    44             1            0        0     0
    53             0            0        1     0
    57             0            0        0     1

In [63]:
df1 =  pd.crosstab(df.Sex,df.Education,df.Marks, aggfunc="sum",margins=True)

df1.columns = ["Bachelors","High School","Masters","Ph.d.","tot_rows"]
df1.index = ["Female","Male","col_total"]
df1

           Bachelors  High School  Masters  Ph.d.  tot_rows
Female            54           60       46     41       201
Male              44           40       53     57       194
col_total         98          100       99     98       395

In [64]:
hyp = df1.iloc[0:2,0:4]
hyp

        Bachelors  High School  Masters  Ph.d.
Female         54           60       46     41
Male           44           40       53     57

In [65]:
tf =  np.outer(df1["tot_rows"][0:2],
                     df1.loc["col_total"][0:4]) / 395.0
tf = pd.DataFrame(tf)
tf.columns = ["Bachelors","High School","Masters","Ph.d."]
tf.index = ["Female","Male"]
tf

        Bachelors  High School    Masters      Ph.d.
Female  49.868354    50.886076  50.377215  49.868354
Male    48.131646    49.113924  48.622785  48.131646

In [66]:
chi_test =  (((tf-hyp)**2)/tf).sum().sum()

print(chi_test)

8.006066246262538

In [68]:
critical = stats.chi2.ppf(q = 0.95, 
                      df = 3)   

print("Critical value: ",critical)

Critical value:  7.814727903251179

In [71]:
#The degrees of freedom equals the product of the number of categories in each variable minus 1.
#Therefore, a 2x4 table so df = 1x3 = 3.
p = 1 - stats.chi2.cdf(x=chi_test,df=3)
print("P value: ",p)

P value:  0.04588650089174717

In [73]:
stats.chi2_contingency(observed=hyp)

(8.006066246262538,
 0.045886500891747214,
 3,
 array([[49.86835443, 50.88607595, 50.37721519, 49.86835443],
        [48.13164557, 49.11392405, 48.62278481, 48.13164557]]))

Problem Statement 2:
Using the following data, perform a oneway analysis of variance using Î±=.05. Write
up the results in APA format.

[Group1: 51, 45, 33, 45, 67]
[Group2: 23, 43, 23, 43, 45]
[Group3: 56, 76, 74, 87, 56]

In [75]:
#AONVA
Group1 = [51, 45, 33, 45, 67]
Group2 = [23, 43, 23, 43, 45]
Group3 = [56, 76, 74, 87, 56]

In [76]:
stat, pvalue = stats.f_oneway(Group1,Group2,Group3)
print("F Statistic value {} , p-value {}".format(stat,pvalue))
if pvalue < 0.05:
    print('True')
else:
    print('False')

F Statistic value 9.747205503009463 , p-value 0.0030597541434430556
True

The p-value is significant at 99% confidence level. Here the p-value returned is 0.00305 which is < 0.05

**Problem Statement 3:**

Calculate F Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25.
For 10, 20, 30, 40, 50:

In [77]:
stats.f_oneway([10,20,30,40,50,60],[5,10,15,20,25])

F_onewayResult(statistic=4.909090909090908, pvalue=0.05394592050940719)

In [83]:
grp1 = [10,20,30,40,50]
grp2 = [5,10,15,20,25]

mean = np.mean(grp1)
mean1 = np.mean(grp2)

x = 0
y = 0
for i in grp1:
    x = x + (i-mean)**2
for j in grp2:
    y = y + (j - mean1)**2

xy = x/(len(grp1)-1)
yx = y/(len(grp2)-1)

F_test = xy/yx
print(grp1,grp2,"F_test is:",F_test)

[10, 20, 30, 40, 50] [5, 10, 15, 20, 25] F_test is: 4.0